import sys

if __name__ == "__main__":
    var1 = sys.argv[1]
    var1 = str(var1) + "_ADDED"

    # 입력되는 arg 값을 정상적으로 입력받고, return 되는 것 확인완료
    print(var1)
    
    # 해당 방식으로는 실제 nodeJS쪽으로 값전달 불가
    #sys.stdout.flush( [1.034034,2.3848384,3.3848394,4.384834,5.3948384,6.38473743,6.3848384,6.3847384,4.38473743,3.38473743,3.34737483] )

    #print(sys.executable)
    # print 방식으로 입력하면, Raw Data 그대로 전달됨.
    #print( [1.034034,2.3848384,3.3848394,4.384834,5.3948384,6.38473743,6.3848384,6.3847384,4.38473743,3.38473743,3.34737483] )
